
## Plan Result (prod)




<pre><code>Plan: 1 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.vodasa_storage_account_primary_access_key
* Update
  * azurerm_monitor_metric_alert.storage_final_alert_capacity[0]
  * module.datafactory[0].azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;prevoda&#34;]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.sa_storage_account.azurerm_storage_account.storage_account
  * module.vodasa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.vodasa_storage_account_primary_access_key will be created
  + resource "azurerm_key_vault_secret" "vodasa_storage_account_primary_access_key" {
      + expiration_date         = "2025-06-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.KeyVault/vaults/pre-hmctskv-prod"
      + name                    = "vodasa-storage-account-primary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_monitor_metric_alert.storage_final_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_final_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ scopes                   = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod",
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod",
        ]
        tags                     = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.datafactory[0].azurerm_data_factory_linked_service_azure_blob_storage.this["prevoda"] will be updated in-place
  ~ resource "azurerm_data_factory_linked_service_azure_blob_storage" "this" {
        id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.DataFactory/factories/pre-vodafone-prod/linkedservices/prevoda"
        name                       = "prevoda"
      - service_endpoint           = (sensitive value) -> null
      - storage_kind               = "StorageV2" -> null
        # (10 unchanged attributes hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod"
        name                               = "prefinalsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod"
        name                               = "preingestsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/presaprod"
        name                               = "presaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.108.242",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.vodasa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prevodasaprod"
        name                               = "prevodasaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":981,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->